extends Node


###############################  structure    ##############################
##############  human_data_absclass ############
###1.  基本信息subhuman_base_class： 
###            id, 姓名，性别，年龄，种族,

###2   属性信息：
###    2.1 基础属性： 力量，敏捷，智力，魅力， 攻击，防御
###    2.2 衍生属性： 生命值，精力值，体力值，攻击力， 防御力， 抗性， 负重力

###3.  外貌信息： 
###    3.1 模型数据：mesh信息，skin信息，skeleton信息，texture信息，ani_tree信息
###    3.2 毛发数据：
###    3.3 纹身数据：
###    3.4 其他数据：

###4   技能属性：
###    4.1 战斗技能：
###    4.2 生存技能
###    4.3 社交技能
###    4.4 专业技能：

###5   装备信息：
###    5.1装备槽位： 头，躯干，手，腿脚，武器，盾牌
###    5.2装备属性：装备耐久，重量，移动惩罚
###    5.3特殊标志：阵营等

###6   成就信息：经验，等级，声望，

###7   关系网

###8   状态信息

###9   财产信息


#############  human_node_absclass  #########
###1   
#    
